{
  "header": {
    "name": "Сергій Місюк",
    "position": "REACT РОЗРОБНИК",
    "summary": "Я react розробник, цікавлюсь різними технологіями та бібліотеками, вивчаю англійську мову. На даний момент мені дуже подобається фронтенд, тому я приділяю йому багато часу. Я хочу працювати в команді та вдосконалювати свій досвід."
  },
  "contacts": {
    "title": "Контакти",
    "address": "Ізраїль, Ход Хашарон"
  },
  "hardSkills": {
    "title": "Технічні навички"
  },
  "languages": {
    "title": "Мови",
    "en": "Українська - носій мови",
    "ua": "Англійська - Pre Intermediate"
  },
  "education": {
    "title": "Освіта",
    "one": {
      "title": "GoIT - освітня платформа",
      "period": "трав 2022 - квіт 2023, on-line",
      "name": "Full stack розробник"
    },
    "two": {
      "title": "Національний Аграрний Університет",
      "period": "вер 2004 - трав 2010, Миколаїв",
      "name": "Інженер, магістр"
    }
  },
  "work": {
    "title": "Досвід роботи",
    "one": {
      "title": "Crossfit тренер - спортивний клуб MKCF",
      "period": "лист 2015 - жовт 2020, Миколаїв",
      "firstListItem": "Робота з клієнтами, визначення їх потреб",
      "secondListItem": "Вивчення професіних курсів",
      "partOne": "Досягнення: я зробив додаток",
      "partTwo": "для моніторингу відвідувань клієнтів та обліку платежів. Зроблено автоматичний сервіс",
      "partThree": "привітання клієнтів з днем ​​народження, що підвищило їхню лояльність до клубу."
    },
    "two": {
      "title": "Менеджер з продажу - Landtech LLC",
      "period": "січ 2011 - жовт 2015, Миколаїв",
      "firstListItem": "Комунікація з клієнтами та визначення їх потреб",
      "secondListItem": "Вивчення технічної документації та професійних курсів",
      "thirdListItem": "Аналітика замовлень та формування складу товарів",
      "partOne": "Досягнення: був одним з кращих менеджерів відділу. Також навчав нових співробітників, щоб збільшити мережу та прибуток компанії."
    },
    "three": {
      "title": "Frontend розробник - Baza Trainee Ukraine (частково зайнятий)",
      "period": "жовт 2023 - січ 2024, віддалено",
      "firstListItem": "Керівник команди Frontend розробників",
      "secondListItem": "Комунікація з клієнтом по його задачам",
      "thirdListItem": "Підтримка проекту після запуску. Оновлення функціоналу.",
      "partOne": "Досягнення: за відсутності проектного менеджера організував комунікацію в середині команди між розробниками, тестувальниками і дизайнером."
    }
  },
  "projects": {
    "title": "Досвід на проектах",
    "one": {
      "title": "Telegram бот",
      "subTitle": "- сервіс з веб додатком для надсилання оголошень у канал месенджеру",
      "used": "React js, hooks, router, form, yup, emotion, mixins, axios, firebase, node, express, cors, telegram api, google cloud platform..."
    },
    "two": {
      "title": "Warehouse",
      "subTitle": "мобільний додаток для контролю залишків запасів на складі",
      "used": "React Native",
      "desc": "Я приєднався до проекту, коли існуючу мобільну версію додатку warehouse переписали до розмірів планшета та розширили функціональність. Зробили таблиці, випадаючі списки, вікно товару"
    },
    "three": {
      "title": "Фотосоціальна мережа",
      "subTitle": "мобільний додаток для публікації фотографій і повідомлень",
      "used": "React Native, Expo, Redux, location, camera, Firebase"
    },
    "four": {
      "title": "SoYummy",
      "subTitle": "Full stack проект. Кулінарна книга з рецептами та списками покупок",
      "used": "React, hooks, react-redux, react-router-dom, portal, lazy, reduxpersist, formik, emotion/styled, yup, prop-types, toastify, paginate, node, express, mongodb, mongoose, cloudinary, swagger....",
      "desc": "Командний проект. Моя роль - керівник команди. Створення архітектури проекту. На node js я написав маршрут пошуку за назвою та інгредієнтом, а також допомагав писати запити до бази даних для інших розробників. Написав частину swagger документації. На React, я створив розділ «популярні рецепти», допомогав колегам у різних розділах. Розгорнув клієнт і сервер на хостингу."
    },
    "five": {
      "title": "Filmoteka",
      "subTitle": "Сайт для пошуку фільмів, читання деталей та перегляду трейлерів",
      "used": "JavaScript, Rest.API, axios, async/await, npm, firebase, SASS, HTML",
      "desc": "Командний проект. Моя роль - керівник команди. Створення архітектури проекту. Також робив верстку та стилізацію хедера. Вивчення документації API. Написання класу фільмотеки. Робота з якістю зображеннь. Виправлення помилок."
    },
    "six": {
      "title": "Icecream",
      "subTitle": "Сайт для продажу товарів",
      "used": "HTML, SASS, Java Script, JQuery",
      "desc": "Командний проект. Моя роль - керівник команди. Створення архітектури проекту. Допомога команді з їхніми запитаннями. Виправлення помилок."
    },
    "seven": {
      "title": "Status АК",
      "subTitle": "- сайт для адвокатської компанії",
      "used": "React js, axios, api, react hook form, yup, styled components, VPS",
      "desc": "Командний проект. Моя роль — керівник команди frontend розробників. Створена архітектура frontend. Підтримка клієнта після розгортання продукту. Виправлення прихованих помилок, створення нових функцій. Додавання meta pixel дій. Розгортання коду в vps. Очищення старих індексованих сторінок із google search console."
    },
    "eight": {
      "title": "Posts API",
      "subTitle": "- API для публікації постів і продажу книг",
      "used": "Node js, express, SQLite, JWT, Swagger, AWS EC2, AWS Route 53, html+scss+js",
      "desc": "Працював сам. Створив захищені та відкриті маршрути, авторизацію, підключив SQLite. API має кілька сутностей, які логічно об'єднані. Написав swagger документацію та окрему детальну HTML-сторінку. Хостинг на сервері Amazon, зберігання файлів в окремому сховищі."
    },
    "nine": {
      "title": "Use prosto",
      "subTitle": "- сайт і CMS для адвокатського центру",
      "used": "React js, firebase, google cloud, redux, styled components, react hook form",
      "desc": "Командний проект. Моя роль - керівник проекту, розробка дизайну CMS (react js), написання сторінок для CMS, виправлення помилок. Розгортання на хостингу Firebase, створення функції Firebase для резервної копії бази даних у хмарне відро Google, налаштування завдання перенесення для резервної копії файли в інше відро."
    },
    "ten": {
      "title": "Furycomics",
      "subTitle": "- сайт і CMS для продажу коміксів і читання онлайн",
      "used": "React js, firebase, redux, styled components, i18next, react hook form, stripe, react-pdf, slick-carousel...",
      "desc": "Командний проект. Моя роль - керівник проекту, розробка дизайну CMS (react js), написав більшу частину коду, виправив помилки. Написано функціонал для продажу товарів. Розроблено інтерфейс для онлайн-читання. Друк PDF документів замовленнь. Розгорнуто на хостингу Firebase"
    }
  }
}
